Revit 2026 API

# Generic Class

---

A static class that provides access to the property names that appear in the Generic visual asset schema.

SystemObject Autodesk.Revit.DB.VisualGeneric

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class Generic
```
```vb
Public NotInheritable Class Generic
```
```cpp
public ref class Generic abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Generic = class end
```

The Generic type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ColorByObject | The property labeled "Color By Object" from the "Generic" schema. |
|  | CommonTintColor | The property labeled "Tint Color" from the "Generic" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "Generic" schema. |
|  | GenericBumpAmount | The property labeled "Amount" from the "Generic" schema. |
|  | GenericBumpMap | The property labeled "Bump" from the "Generic" schema. |
|  | GenericCutoutOpacity | The property labeled "Cutouts" from the "Generic" schema. |
|  | GenericDiffuse | The property labeled "Color/Image" from the "Generic" schema. |
|  | GenericDiffuseImageFade | The property labeled "Image Fade" from the "Generic" schema. |
|  | GenericGlossiness | The property labeled "Glossiness" from the "Generic" schema. |
|  | GenericIsMetal | The property labeled "Highlights" from the "Generic" schema. |
|  | GenericReflectivityAt0deg | The property labeled "Reflectivity/Direct" from the "Generic" schema. |
|  | GenericReflectivityAt90deg | The property labeled "Reflectivity/Oblique" from the "Generic" schema. |
|  | GenericRefractionIndex | The property labeled "Refraction" from the "Generic" schema. |
|  | GenericRefractionTranslucencyWeight | The property labeled "Translucency" from the "Generic" schema. |
|  | GenericSelfIllumColorTemperature | The property labeled "Color Temperature" from the "Generic" schema. |
|  | GenericSelfIllumFilterMap | The property labeled "Filter Color" from the "Generic" schema. |
|  | GenericSelfIllumLuminance | The property labeled "Luminance" from the "Generic" schema. |
|  | GenericTransparency | The property labeled "Transparency" from the "Generic" schema. |
|  | GenericTransparencyImageFade | The property labeled "Image Fade" from the "Generic" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace